// import { useEffect, useState } from "react";

// import { addDoc, collection, getDocs } from "firebase/firestore";
// import { db } from "../firebase";




// const fetchBaseMenus = async () => {
//   const snapshot = await getDocs(collection(db, "baseMenus"));
//   return snapshot.docs.map(doc => ({ id: doc.id, ...doc.data() }));
// }
// const createBaseMenu = async (menu) => {
//   const docRef = await addDoc(collection(db, "baseMenus"), menu);
//   return { id: docRef.id, ...menu };
// };




// export default function BaseMenuList() {
//   const [menus, setMenus] = useState([]);

//   useEffect(() => {
//     const load = async () => {
//       const data = await fetchBaseMenus();
//       setMenus(data);
//     };
//     load();
//   }, []);

//   const handleAdd = async () => {
//     const addBaseMenu = [








//     ];
//     for (const menu of addBaseMenu) {
//       await createBaseMenu(menu);
//     }

//     const data = await fetchBaseMenus();
//     setMenus(data);

//   };


//   return (
//     <div>
//       <h2>献立一覧</h2>

//       {menus.length === 0 ? (
//         <p>データがありません</p>
//       ) : (
//         <ul>
//           {
//             menus.map((menu) => (
//               <li key={menu.id}>
//                 {menu.name} (カテゴリ：{menu.category}) 材料：{(menu.ingredients || []).join(",")}
//               </li>
//             ))
//           }
//         </ul>
//       )}
//       <button onClick={handleAdd}>テストデータ追加</button>
//     </div>
//   )

// };



// {
//   category: "肉",
//   name: "すき焼き",
//   ingredients: ["牛肉", "玉ねぎ", "白ねぎ", "椎茸", "焼き豆腐", "糸こんにゃく", "醤油", "砂糖", "みりん",]
// },
// {
//   category: "肉",
//   name: "チャプチェ",
//   ingredients: ["牛肉", "玉ねぎ", "パプリカ", "椎茸", "ニラ", "春雨", "ニンニク", "ごま油", "醤油", "酒", "みりん", "オイスターソース",]
// },

//  {
//   category: "肉",
//   name: "ビーフシチュー",
//   ingredients: ["牛肉", "玉ねぎ", "にんじん", "じゃがいも", "油", "ビーフシチューのルウ", "塩コショウ", "薄力粉",]
// },

// {
//   category: "肉",
//   name: "プルコギ",
//   ingredients: ["牛肉", "玉ねぎ", "にんじん", "ニラ", "しめじ", "白ごま", "ニンニク", "ショウガ", "ごま油", "醤油", "酒", "砂糖", "コチュジャン",]
// },
// {
//   category: "肉",
//   name: "肉うどん",
//   ingredients: ["牛肉", "青ネギ", "うどん", "ショウガ", "うどんつゆ", "醤油", "酒", "みりん", "砂糖",]
// },
// {
//   category: "肉",
//   name: "牛肉とピーマンの甘辛炒め",
//   ingredients: ["牛肉", "ピーマン", "玉ねぎ", "油", "塩コショウ", "醤油", "酒", "みりん", "砂糖", "片栗粉",]
// },
// {
//   category: "肉",
//   name: "牛丼",
//   ingredients: ["牛肉", "玉ねぎ", "油", "醤油", "酒", "みりん", "砂糖", "顆粒だし",]
// },
// {
//   category: "肉",
//   name: "カレー",
//   ingredients: ["牛肉", "玉ねぎ", "にんじん", "じゃがいも", "ごはん", "油", "カレーのルウ",]
// },
// {
//   category: "肉",
//   name: "ビビンバ丼",
//   ingredients: ["牛肉", "もやし", "にんじん", "ほうれん草", "卵", "米", "白ごま", "ニンニク", "ショウガ", "ごま油", "塩", "酒", "砂糖", "醤油", "コチュジャン", "こしょう",]
// },
// {
//   category: "肉",
//   name: "ハヤシライス",
//   ingredients: ["牛肉", "玉ねぎ", "マッシュルーム", "ごはん", "油", "ハヤシライスのルウ",]
// },
// {
//   category: "肉",
//   name: "ホイコーロー",
//   ingredients: ["豚肉", "キャベツ", "ピーマン", "ニンニク", "油", "醤油", "酒", "テンメンジャン", "砂糖", "豆板醤", "片栗粉",]
// },
// {
//   category: "肉",
//   name: "肉じゃが",
//   ingredients: ["豚肉", "玉ねぎ", "にんじん", "じゃがいも", "油", "醤油", "酒", "みりん", "砂糖", "顆粒だし",]
// },
// {
//   category: "肉",
//   name: "生姜焼き",
//   ingredients: ["豚肉", "ショウガ", "油", "醤油", "酒", "みりん", "砂糖",]
// },
// {
//   category: "肉",
//   name: "豚キムチ",
//   ingredients: ["豚肉", "玉ねぎ", "もやし", "ニラ", "白菜キムチ", "ごま油", "醤油", "塩コショウ",]
// },
// {
//   category: "肉",
//   name: "豚肉のピカタ",
//   ingredients: ["豚肉", "卵", "粉チーズ", "オリーブオイル", "ケチャップ", "薄力粉",]
// },
// {
//   category: "肉",
//   name: "とんぺい焼き",
//   ingredients: ["豚肉", "卵", "キャベツ", "かつおぶし", "油", "塩", "塩コショウ", "お好みソース", "マヨネーズ",]
// },
// {
//   category: "肉",
//   name: "豚肉と白菜の重ね蒸し",
//   ingredients: ["豚肉", "白菜", "ショウガ", "塩", "醤油", "顆粒だし",]
// },
// {
//   category: "肉",
//   name: "豚肉もやし蒸し",
//   ingredients: ["豚肉", "もやし", "にんじん", "青ネギ", "ポン酢",]
// },
// {
//   category: "肉",
//   name: "トンテキ",
//   ingredients: ["豚肉", "ニンニク", "油", "塩コショウ", "酒", "みりん", "砂糖", "醤油", "中濃ソース", "ケチャップ",]
// },
// {
//   category: "肉",
//   name: "トンカツ",
//   ingredients: ["豚肉", "卵", "油", "パン粉", "薄力粉", "塩コショウ", "中濃ソース",]
// },
// {
//   category: "肉",
//   name: "豚の角煮",
//   ingredients: ["豚肉", "卵", "米", "ショウガ", "酒", "砂糖", "醤油",]
// },
// {
//   category: "肉",
//   name: "豚の角煮",
//   ingredients: ["豚肉", "卵", "米", "ショウガ", "酒", "砂糖", "醤油",]
// },
// {
//   category: "肉",
//   name: "酢豚",
//   ingredients: ["豚肉", "玉ねぎ", "ピーマン", "パプリカ", "油", "塩コショウ", "醤油", "砂糖", "酢", "ケチャップ", "片栗粉",]
// },
// {
//   category: "肉",
//   name: "肉巻き",
//   ingredients: ["豚肉", "にんじん", "いんげん", "油", "醤油", "砂糖", "みりん", "酒",]
// },
// {
//   category: "肉",
//   name: "お好み焼き",
//   ingredients: ["豚肉", "長いも", "卵", "キャベツ", "天かす", "かつお節", "青のり", "油", "薄力粉", "顆粒だし", "お好みソース", "マヨネーズ",]
// },
// {
//   category: "肉",
//   name: "焼きそば",
//   ingredients: ["豚肉", "キャベツ", "もやし", "中華麺", "油", "中濃ソース",]
// },
// {
//   category: "肉",
//   name: "焼きうどん",
//   ingredients: ["豚肉", "キャベツ", "にんじん", "ニラ", "うどん", "かつお節", "油", "塩コショウ", "醤油", "酒", "顆粒だし",]
// },
// {
//   category: "肉",
//   name: "鍋",
//   ingredients: ["豚肉", "白菜", "木綿豆腐", "しいたけ", "白ネギ", "鍋だし"]
// },
// {
//   category: "肉",
//   name: "チャーシュー",
//   ingredients: ["豚肉", "卵", "白ネギ", "ニンニク", "ショウガ", "油", "酒", "砂糖", "醤油", "みりん", "はちみつ",]
// },
// {
//   category: "肉",
//   name: "ポトフ",
//   ingredients: ["豚肉", "にんじん", "玉ねぎ", "じゃがいも", "コンソメ", "ローリエ", "塩コショウ",]
// },
// {
//   category: "肉",
//   name: "クリームシチュー",
//   ingredients: ["鶏肉", "玉ねぎ", "にんじん", "じゃがいも", "牛乳", "ブロッコリー", "油", "シチューのルウ",]
// },
// {
//   category: "肉",
//   name: "唐揚げ",
//   ingredients: ["鶏肉", "ショウガ", "ニンニク", "油", "薄力粉", "片栗粉", "ブロッコリー", "醤油", "酒",]
// },
// {
//   category: "肉",
//   name: "親子丼",
//   ingredients: ["鶏肉", "卵", "玉ねぎ", "三つ葉", "米", "顆粒だし", "砂糖", "醤油", "みりん",]
// },
// {
//   category: "肉",
//   name: "照り焼きチキン",
//   ingredients: ["鶏肉", "砂糖", "醤油", "みりん", "酒",]
// },
// {
//   category: "肉",
//   name: "チキン南蛮",
//   ingredients: ["鶏肉", "卵", "油", "薄力粉", "塩コショウ", "醤油", "みりん", "酢", "砂糖", "塩", "マヨネーズ", "ケチャップ",]
// },
// {
//   category: "肉",
//   name: "鶏肉のクリーム煮",
//   ingredients: ["鶏肉", "ほうれん草", "玉ねぎ", "しめじ", "牛乳", "薄力粉", "塩コショウ", "バター", "コンソメ",]
// },
// {
//   category: "肉",
//   name: "チキングラタン",
//   ingredients: ["鶏肉", "玉ねぎ", "しめじ", "マカロニ", "牛乳", "油", "パン粉", "薄力粉", "塩", "バター", "コンソメ",]
// },
// {
//   category: "肉",
//   name: "チキンソテー",
//   ingredients: ["鶏肉", "油", "塩コショウ",]
// },
// {
//   category: "肉",
//   name: "サラダチキン",
//   ingredients: ["鶏肉", "砂糖", "ニンニク", "塩", "中華だし", "レモン汁",]
// },
// {
//   category: "肉",
//   name: "バンバンジー",
//   ingredients: ["鶏肉", "きゅうり", "トマト", "白ネギ", "ねりごま", "ショウガ", "酒", "砂糖", "酢", "醤油",]
// },

// {
//   category: "肉",
//   name: "チキンライス",
//   ingredients: ["鶏肉", "玉ねぎ", "ピーマン", "にんじん", "米", "油", "塩コショウ", "ケチャップ",]
// },
// {
//   category: "肉",
//   name: "タコライス",
//   ingredients: ["合いびき肉", "玉ねぎ", "レタス", "トマト", "チーズ", "米", "ニンニク", "油", "塩コショウ", "醤油", "酒", "ケチャップ",]
// },
// {
//   category: "肉",
//   name: "キーマカレー",
//   ingredients: ["合いびき肉", "玉ねぎ", "にんじん","ピーマン", "米", "ニンニク", "ショウガ", "油", "カレーのルウ", ]
// },
// {
//   category: "肉",
//   name: "マーボーナス",
//   ingredients: ["合いびき肉", "玉ねぎ", "ピーマン", "パプリカ", "卵", "米", "ニンニク", "バジル", "油", "ナンプラー", "オイスターソース", "酒", "砂糖",]
// },
// {
//   category: "肉",
//   name: "ハンバーグ",
//   ingredients: ["合いびき肉", "玉ねぎ", "パン粉", "卵", "牛乳", "油", "塩コショウ", "ナツメグ", "酒", "ケチャップ", "ウスターソース",]
// },
// {
//   category: "肉",
//   name: "ピーマン肉詰め",
//   ingredients: ["合いびき肉", "玉ねぎ", "ピーマン", "牛乳", "油", "薄力粉", "塩コショウ", "みりん", "酒", "オイスターソース",]
// },
// {
//   category: "肉",
//   name: "ミートソーススパゲッティ",
//   ingredients: ["合いびき肉", "玉ねぎ", "トマト缶", "スパゲティ", "ニンニク", "塩", "黒コショウ", "油", "砂糖", "コンソメ", "ケチャップ", "ウスターソース",]
// },
// {
//   category: "肉",
//   name: "コロッケ",
//   ingredients: ["合いびき肉", "玉ねぎ", "じゃがいも", "卵", "バター", "油", "薄力粉", "パン粉", "塩コショウ", "砂糖",]
// },
// {
//   category: "肉",
//   name: "豆腐ハンバーグ",
//   ingredients: ["合いびき肉", "木綿豆腐", "玉ねぎ", "卵", "油", "塩コショウ", "コンソメ", "片栗粉",]
// },
// {
//   category: "肉",
//   name: "ミンチカツ",
//   ingredients: ["豚ひき肉", "玉ねぎ", "パン粉", "卵", "油", "薄力粉", "塩コショウ", "ケチャップ", "ウスターソース",]
// },


// {
//   category: "肉",
//   name: "ロールキャベツ",
//   ingredients: ["豚ひき肉", "キャベツ", "玉ねぎ", "卵", "パン粉", "塩コショウ", "ナツメグ", "コンソメ", "ケチャップ", "ローリエ",]
// },
// {
//   category: "肉",
//   name: "ミートボール",
//   ingredients: ["豚ひき肉", "玉ねぎ", "パン粉", "卵", "牛乳", "塩", "ナツメグ", "黒コショウ", "ケチャップ", "中濃ソース", "醤油",]
// },
// {
//   category: "肉",
//   name: "餃子",
//   ingredients: ["豚ひき肉", "キャベツ", "ニラ", "餃子の皮", "ニンニク", "ショウガ", "ごま油", "油", "砂糖", "オイスターソース", "醤油", "塩コショウ", "片栗粉",]
// },
// {
//   category: "肉",
//   name: "三色丼",
//   ingredients: ["豚ひき肉", "卵", "ほうれん草", "米", "白ごま", "ごま油", "油", "砂糖", "醤油", "酒", "めんつゆ",]
// },
// {
//   category: "肉",
//   name: "ガパオライス",
//   ingredients: ["鶏ひき肉", "ナス", "青ネギ", "ニンニク", "ショウガ", "豆板醤", "テンメンジャン", "砂糖", "醤油", "中華だし", "片栗粉",]
// },

// {
//   category: "肉",
//   name: "鶏そぼろ丼",
//   ingredients: ["鶏ひき肉", "卵", "絹さや", "米", "油", "砂糖", "醤油", "酒", "塩",]
// },
// {
//   category: "肉",
//   name: "照り焼きつくね",
//   ingredients: ["鶏ひき肉", "玉ねぎ", "ショウガ", "青ネギ", "卵", "油", "片栗粉", "塩", "醤油", "酒", "みりん", "塩コショウ",]
// },
// {
//   category: "肉",
//   name: "鶏団子の甘酢あんかけ",
//   ingredients: ["鶏ひき肉", "白ねぎ", "白ごま", "油", "片栗粉", "酢", "醤油", "砂糖", "酒", "塩コショウ", "塩",]
// },
// {
//   category: "肉",
//   name: "ナポリタン",
//   ingredients: ["ウインナー", "玉ねぎ", "ピーマン", "スパゲティ", "油", "ニンニク", "ケチャップ", "ウスターソース", "牛乳", "バター", "粉チーズ",]
// },
// {
//   category: "肉",
//   name: "ミネストローネ",
//   ingredients: ["ベーコン", "玉ねぎ", "にんじん", "じゃがいも", "キャベツ", "トマト缶", "オリーブオイル", "パセリ", "コンソメ", "塩",]
// },
// {
//   category: "肉",
//   name:"ミックスピザ",
//   ingredients: ["ピザ生地", "サラミ", "玉ねぎ", "ピーマン", "キャベツ", "トマト", "チーズ", "ピザソース",]
// },
// {
//   category: "肉",
//   name:  "ラーメン",
//   ingredients: ["チャーシュー", "卵", "メンマ", "青ネギ", "中華麺", "ごま油", "中華だし", "醤油","塩","ニンニク","こしょう",]
// },





// {
//   category: "魚",
//   name: "刺身",
//   ingredients: ["刺身", "醤油", "わさび",]
// },
// {
//   category: "魚",
//   name: "まぐろとろろ丼",
//   ingredients: ["まぐろ", "長いも", "のり", "青のり", "米", "醤油", "みりん", "わさび",]
// },
// {
//   category: "魚",
//   name: "鮭の塩焼き",
//   ingredients: ["鮭", "油", "塩",]
// },
// {
//   category: "魚",
//   name: "鮭のムニエル",
//   ingredients: ["鮭", "レモン", "油", "バター", "薄力粉", "塩コショウ",]
// },
// {
//   category: "魚",
//   name: "鮭の西京焼き",
//   ingredients: ["鮭", "油", "白みそ", "塩", "酒", "みりん",]
// },
// {
//   category: "魚",
//   name: "鮭のちゃんちゃん焼き",
//   ingredients: ["鮭", "キャベツ", "玉ねぎ", "しめじ", "にんじん", "コーン", "ニンニク", "バター", "みそ", "酒", "砂糖", "みりん", "醤油", "塩コショウ",]
// },
// {
//   category: "魚",
//   name: "鮭のホイル焼き",
//   ingredients: ["鮭", "にんじん", "玉ねぎ", "しめじ", "えのき", "青ネギ", "レモン汁", "バター", "油", "酒", "砂糖", "塩", "醤油",]
// },
// {
//   category: "魚",
//   name: "鮭のグラタン",
//   ingredients: ["鮭", "じゃがいも", "玉ねぎ", "エリンギ", "牛乳", "チーズ", "油", "バター", "薄力粉", "塩コショウ", "コンソメ",]
// },
// {
//   category: "魚",
//   name: "鮭のクリーム煮",
//   ingredients: ["鮭", "ほうれん草", "牛乳", "バター", "薄力粉", "塩コショウ", "塩",]
// },
// {
//   category: "魚",
//   name: "サーモンのカルパッチョ",
//   ingredients: ["サーモン", "玉ねぎ", "レモン汁", "オリーブオイル", "塩", "黒コショウ",]
// },
// {
//   category: "魚",
//   name: "サバの塩焼き",
//   ingredients: ["サバ", "塩",]
// },
// {
//   category: "魚",
//   name: "サバの味噌煮",
//   ingredients: ["サバ", "白ネギ", "ショウガ", "塩", "酒", "砂糖", "顆粒だし", "みそ",]
// },
// {
//   category: "魚",
//   name: "サバの煮付け",
//   ingredients: ["サバ", "ショウガ", "塩", "酒", "砂糖", "醤油", "みりん",]
// },
// {
//   category: "魚",
//   name: "さば缶カレー",
//   ingredients: ["サバの水煮缶", "玉ねぎ", "大豆", "トマト", "ニンニク", "ショウガ", "カレーのルウ", "黒コショウ",]
// },
// {
//   category: "魚",
//   name: "ぶりの照り焼き",
//   ingredients: ["ぶり", "白ねぎ", "油", "砂糖", "醤油", "みりん", "酒",]
// },
// {
//   category: "魚",
//   name: "ぶり大根",
//   ingredients: ["ぶり", "大根", "米", "ショウガ", "だし汁", "醤油", "みりん", "砂糖", "酒",]
// },
// {
//   category: "魚",
//   name: "カツオのたたき",
//   ingredients: ["カツオのたたき", "ショウガ", "ニンニク", "青ネギ", "大葉",]
// },
// {
//   category: "魚",
//   name: "あじの塩焼き",
//   ingredients: ["あじ", "大根", "塩", "醤油", "レモン汁",]
// },
// {
//   category: "魚",
//   name: "あじフライ",
//   ingredients: ["あじ", "卵", "油", "塩", "こしょう", "パン粉", "薄力粉", "ウスターソース",]
// },
// {
//   category: "魚",
//   name: "あじの南蛮漬け",
//   ingredients: ["あじ", "玉ねぎ", "にんじん", "ピーマン", "唐辛子", "油", "醤油", "酢", "砂糖",]
// },
// {
//   category: "魚",
//   name: "いわしの蒲焼き",
//   ingredients: ["いわし", "油", "薄力粉", "醤油", "みりん", "酒", "砂糖",]
// },
// {
//   category: "魚",
//   name: "いわしの梅煮",
//   ingredients: ["いわし", "ショウガ", "梅干し", "酢", "醤油", "みりん", "酒", "砂糖",]
// },
// {
//   category: "魚",
//   name: "さわらのバターしょうゆ焼き",
//   ingredients: ["さわら", "バター", "油", "薄力粉", "塩コショウ", "みりん", "酒", "醤油",]
// },
// {
//   category: "魚",
//   name: "さわらの西京焼き",
//   ingredients: ["さわら", "油", "酒", "白みそ", "みりん", "砂糖",]
// },
// {
//   category: "魚",
//   name: "たらのムニエル",
//   ingredients: ["たら", "レモン汁", "バター", "油", "塩コショウ", "薄力粉",]
// },
// {
//   category: "魚",
//   name: "たらのホイル焼き",
//   ingredients: ["たら", "玉ねぎ", "えのき", "しめじ", "レモン", "バター", "塩コショウ", "ポン酢",]
// },
// {
//   category: "魚",
//   name: "たらのチーズピカタ",
//   ingredients: ["たら", "卵", "塩コショウ", "粉チーズ", "オリーブオイル", "パセリ",]
// },
// {
//   category: "魚",
//   name: "白身魚の甘酢あんかけ",
//   ingredients: ["たら", "玉ねぎ", "にんじん", "たけのこ（水煮）", "ピーマン", "油", "塩コショウ", "片栗粉", "鶏がらスープの素", "酒", "砂糖", "酢", "醤油", "ケチャップ",]
// },
// {
//   category: "魚",
//   name: "鯛のカルパッチョ",
//   ingredients: ["たい", "玉ねぎ", "レモン汁", "ブロッコリースプラウト", "オリーブオイル", "砂糖", "塩", "黒コショウ",]
// },
// {
//   category: "魚",
//   name: "鯛のアクアパッツァ",
//   ingredients: ["たい", "ミニトマト", "あさり", "ニンニク", "オリーブオイル", "白ワイン", "塩コショウ", "イタリアンパセリ",]
// },
// {
//   category: "魚",
//   name: "鯛の煮付け",
//   ingredients: ["たい", "白ネギ", "ショウガ", "醤油", "みりん", "砂糖", "酒",]
// },
// {
//   category: "魚",
//   name: "白身魚のフライ",
//   ingredients: ["冷凍白身魚フライ", "油",]
// },
// {
//   category: "魚",
//   name: "カレイの煮つけ",
//   ingredients: ["カレイ", "白ねぎ", "ショウガ", "酒", "砂糖", "醤油", "みりん"]
// },
// {
//   category: "魚",
//   name: "パエリア",
//   ingredients: ["白身魚", "いか", "えび", "あさり", "玉ねぎ", "米", "鶏肉", "トマト缶", "パプリカパウダー", "ニンニク", "レモン", "イタリアンパセリ",]
// },
// {
//   category: "魚",
//   name: "シーフードカレー",
//   ingredients: ["冷凍シーフードミックス", "エリンギ", "玉ねぎ", "ニンニク", "米", "オリーブオイル", "カレーのルウ",]
// },
// {
//   category: "魚",
//   name: "いかと大根の煮物",
//   ingredients: ["いか", "大根", "酒", "みりん", "砂糖", "醤油",]
// },
// {
//   category: "魚",
//   name: "いかのマリネ",
//   ingredients: ["いか", "玉ねぎ", "にんじん", "きゅうり", "オリーブオイル", "塩", "酢", "砂糖", "粒マスタード",]
// },
// {
//   category: "魚",
//   name: "えびフライ",
//   ingredients: ["えび", "卵", "レモン", "油", "薄力粉", "パン粉",]
// },
// {
//   category: "魚",
//   name: "えびチリ",
//   ingredients: ["えび", "白ネギ", "ショウガ", "ニンニク", "油", "酒", "塩", "片栗粉", "豆板醤", "ケチャップ", "砂糖",]
// },
// {
//   category: "魚",
//   name: "えびマヨネーズ",
//   ingredients: ["えび", "青ネギ", "オリーブオイル", "片栗粉", "マヨネーズ", "ケチャップ", "レモン汁", "練乳", "牛乳",]
// },
// {
//   category: "魚",
//   name: "海老ピラフ",
//   ingredients: ["えび", "玉ねぎ", "にんじん", "ピーマン", "コーン", "米", "バター", "コンソメ", "塩コショウ",]
// },
// {
//   category: "魚",
//   name: "えびのクリームパスタ",
//   ingredients: ["えび", "アボカド", "スパゲティ", "牛乳", "バター", "コンソメ", "塩コショウ",]
// },
// {
//   category: "魚",
//   name: "たこ焼き",
//   ingredients: ["たこ","青ネギ","卵","紅ショウガ","天かす","青のり","かつおぶし","油","たこ焼きの素","たこ焼きソース","マヨネーズ",]
// },
// {
//   category: "魚",
//   name: "あさりの酒蒸し",
//   ingredients: ["あさり","青ネギ","塩","酒",]
// },
// {
//   category: "魚",
//   name: "ボンゴレビアンコ",
//   ingredients: ["あさり","ニンニク","スパゲティ","イタリアンパセリ","オリーブオイル","輪切り唐辛子","塩","黒コショウ","白ワイン",]
// },
// {
//   category: "魚",
//   name: "クラムチャウダー",
//   ingredients: ["あさり","ベーコン","じゃがいも","にんじん","玉ねぎ","セロリ","生クリーム","バター","パセリ","薄力粉","コンソメ","塩コショウ","白ワイン",]
// },
// {
//   category: "魚",
//   name: "明太子のパスタ",
//   ingredients: ["明太子","スパゲティ","ニンニク","イタリアンパセリ","バター","オリーブオイル","黒コショウ","塩",]
// },





      // {
      //   category: "その他",
      //   name: "おでん",
      //   ingredients: ["卵", "ちくわ", "さつま揚げ", "大根", "こんにゃく", "顆粒だし", "醤油", "砂糖", "塩", "酒"]
      // },
      // {
      //   category: "その他",
      //   name: "チーズオムレツ",
      //   ingredients: ["卵", "チーズ", "牛乳", "油", "バター", "塩コショウ", "ケチャップ",]
      // },
      // {
      //   category: "その他",
      //   name: "スパニッシュオムレツ",
      //   ingredients: ["卵", "玉ねぎ", "じゃがいも", "オリーブオイル", "塩コショウ",]
      // },
      // {
      //   category: "その他",
      //   name: "ミートオムレツ",
      //   ingredients: ["卵","合いびき肉", "玉ねぎ",  "牛乳", "バター","塩コショウ",  "ケチャップ", "黒コショウ","塩"]
      // },
      // {
      //   category: "その他",
      //   name: "オムライス",
      //   ingredients: ["卵","鶏肉", "玉ねぎ", "米", "牛乳","油","バター","鶏がらスープの素","ケチャップ","塩コショウ"]
      // },
      // {
      //   category: "その他",
      //   name: "だし巻き卵",
      //   ingredients: ["卵","油","顆粒だし","醤油","みりん",]
      // },
      // {
      //   category: "その他",
      //   name: "ニラ玉",
      //   ingredients: ["卵","ニラ","油","塩コショウ","鶏がらスープの素","醤油",]
      // },
      // {
      //   category: "その他",
      //   name: "かに玉炒め",
      //   ingredients: ["卵","かにかま","青ネギ","油","塩コショウ","醤油","酢","醤油","砂糖","片栗粉",]
      // },
      // {
      //   category: "その他",
      //   name: "天津飯",
      //   ingredients: ["卵","かにかま","グリーンピース","米","ごま油","鶏がらスープの素","醤油","酒","塩","黒コショウ","片栗粉",]
      // },
      // {
      //   category: "その他",
      //   name: "スコッチエッグ",
      //   ingredients: ["卵","合いびき肉","玉ねぎ","牛乳","油","ナツメグ","パン粉","塩コショウ","薄力粉","塩","黒コショウ","片栗粉",]
      // },
      // {
      //   category: "その他",
      //   name: "麻婆豆腐",
      //   ingredients: ["木綿豆腐","豚ひき肉","青ネギ","ニンニク","ショウガ","ごま油","豆板醤","酒","鶏がらスープの素","砂糖","醤油","片栗粉",]
      // },
      // {
      //   category: "その他",
      //   name:"肉豆腐",
      //   ingredients: ["木綿豆腐","牛肉","白ネギ","油","酒","砂糖","醤油",]
      // },
      // {
      //   category: "その他",
      //   name:"湯豆腐",
      //   ingredients: ["木綿豆腐","昆布","ポン酢",]
      // },
      // {
      //   category: "その他",
      //   name:"豆腐ステーキ",
      //   ingredients: ["木綿豆腐","青ネギ","かつおぶし","ごま油","薄力粉","酒","みりん","醤油",]
      // },
      // {
      //   category: "その他",
      //   name:"ゴーヤチャンプル",
      //   ingredients: ["木綿豆腐","ゴーヤ","豚肉","卵","油","ごま油","顆粒だし","酒","オイスターソース","醤油",]
      // },
      // {
      //   category: "その他",
      //   name:"豆腐グラタン",
      //   ingredients: ["木綿豆腐","えび","ブロッコリー","玉ねぎ","チーズ","油","塩","薄力粉","マヨネーズ","顆粒だし","塩コショウ",]
      // },
      // {
      //   category: "その他",
      //   name:"マカロニグラタン",
      //   ingredients: ["牛乳","マカロニ","鶏肉","玉ねぎ","マッシュルーム","チーズ","油","バター","薄力粉","塩コショウ",]
      // },
      // {
      //   category: "その他",
      //   name: "ソーセージとポテトのチーズ焼き",
      //   ingredients: ["チーズ","じゃがいも","ソーセージ","コーン","塩コショウ","パセリ",]
      // },