// import { useEffect, useState } from "react";
// import { addDoc, collection, getDocs } from "firebase/firestore";
// import { db } from "../firebase";

// const ingredientsMaster = [

      
     


// ];





// const fetchIngredients = async () => {
//       const snapshot = await getDocs(collection(db, "ingredientsMaster"));
//       return snapshot.docs.map(doc => ({ id: doc.id, ...doc.data() }));
// }
// const createIngredient = async (ingredient) => {
//       const docRef = await addDoc(collection(db, "ingredientsMaster"), ingredient);
//       return { id: docRef.id, ...ingredient };
// };




// export default function IngredientAliases() {
//       const [ingredients, setIngredients] = useState([]);

//       useEffect(() => {
//             const load = async () => {
//                   const data = await fetchIngredients();
//                   setIngredients(data);
//             };
//             load();
//       }, []);

//       const handleAdd = async () => {

//             for (const ingredient of ingredientsMaster) {
//                   await createIngredient(ingredient);
//             }

//             const data = await fetchIngredients();
//             setIngredients(data);

//       };


//       return (
//             <div>
//                   <h2>材料マスタ一覧</h2>

//                   {ingredients.length === 0 ? (
//                         <p>データがありません</p>
//                   ) : (
//                         <ul>
//                               {
//                                     ingredients.map((ingredient) => (
//                                           <li key={ingredient.id}>
//                                                 {ingredient.name} (エイリアス:{(ingredient.aliases || []).join(",")})
//                                           </li>
//                                     ))
//                               }
//                         </ul>
//                   )}
//                   <button onClick={handleAdd}>テストデータ追加</button>
//             </div>
//       )

// };






// { name: "鶏肉", aliases: ["とり肉", "とり", "とりにく"] },
// { name: "鶏もも肉", aliases: ["鶏肉","とり肉","とりもも肉", "鶏モモ肉", "とりモモ肉", "鶏もも", "とりもも", "鶏モモ", "もも肉", "モモ肉",] },
// { name: "鶏むね肉", aliases: ["鶏肉","とり肉","とりむね肉", "鶏ムネ肉", "とりムネ肉", "鶏むね", "とりむね", "鶏ムネ", "むね肉", "ムネ肉",] },
// { name: "ささみ", aliases: ["鶏肉","とり肉","ササミ", "ささ身", "ササ身", "鶏ささみ", "鶏ササミ", "とりささみ", "とりササミ",] },
// { name: "手羽先／手羽元", aliases: ["鶏肉","とり肉","てばさき", "テバサキ", "鶏手羽先", "とり手羽先", "てばもと", "テバモト", "鶏手羽元", "とり手羽元",] },
// { name: "鶏ひき肉", aliases: ["鶏肉","とり肉","とりひき肉", "鶏挽き肉", "とり挽き肉", "鶏ミンチ", "とりミンチ", "鶏ひきにく", "とりひきにく"] },


// { name: "豚肉", aliases: ["ぶたにく", "ぶた肉", "ブタ肉", "ブタニク", "ぶた", "ブタ", "豚",] },
// { name: "豚バラ肉", aliases: ["豚肉","ぶた肉","ぶたばらにく", "ブタバラ肉", "豚ばら肉", "ブタバラ", "ブタばら", "豚ばら", "バラ肉"] },
// { name: "豚バラブロック", aliases: ["豚肉","ぶた肉","ぶたばらぶろっく", "ブタバラブロック", "豚ばらブロック", "バラブロック"] },
// { name: "豚こま切れ肉", aliases: ["豚肉","ぶた肉","ぶたこまきれにく", "豚こまきれ肉", "ブタコマ肉", "豚コマ肉", "豚こま肉", "ブタコマ", "豚こま", "豚コマ", "こま切れ肉"] },
// { name: "豚ロース", aliases: ["豚肉","ぶた肉","ぶたろーす", "ブタロース", "豚ろーす肉", "ロース肉", "豚ロース肉"] },
// { name: "豚ひき肉", aliases: ["豚肉","ぶた肉","ぶたひきにく", "ブタひき肉", "ぶたひき肉", "豚ミンチ", "ぶたミンチ"] },
// { name: "牛肉", aliases: ["ぎゅうにく", "ぎゅう肉", "ギュウ肉", "ギュウニク", "うし", "ウシ", "牛",] },
// { name: "牛こま切れ肉", aliases: ["牛肉","ぎゅうこまきれにく", "ギュウコマ", "牛こま", "牛こま肉", "こま切れ牛肉"] },
// { name: "牛バラ肉", aliases: ["牛肉","ぎゅうばらにく", "ギュウバラ", "牛ばら", "牛ばら肉", "バラ肉（牛）"] },
// { name: "牛ひき肉", aliases: ["牛肉","ぎゅうひきにく", "ギュウひき肉", "牛ミンチ", "ぎゅうミンチ"] },



// { name: "ウインナー", aliases: ["ウィンナー","ういんなー","ウインナ","ウィンナ","ソーセージ","ソーセジ"] },
// { name: "合いびき肉", aliases: ["あいびき肉","あい挽き肉","合挽き肉","合びき肉","あいびき","合い挽き","合挽き"] },
// { name: "ベーコン", aliases: ["べーこん"] },
// { name: "ハム", aliases: ["はむ","ロースハム","ハムスライス","スライスハム",] },
// { name: "サラミ", aliases: ["さらみ","ドライソーセージ",] },
// { name: "チャーシュー", aliases: ["焼豚","焼き豚","ちゃーしゅー","豚チャーシュー",] },


// { name: "卵", aliases: ["たまご","タマゴ", "玉子"] },
// { name: "牛乳", aliases: ["ぎゅうにゅう","ミルク", "みるく"] },
// { name: "チーズ", aliases: ["とろけるチーズ","ピザ用チーズ", "プロセスチーズ","スライスチーズ","シュレッドチーズ",] },
// { name: "粉チーズ", aliases: ["こなチーズ", "パルメザンチーズ","パルメザン","粉パルメザン",] },
// { name: "バター", aliases: ["無塩バター", "有塩バター",] },
// { name: "生クリーム", aliases: ["動物性生クリーム", "ホイップクリーム","クリーム",] },



// { name: "まぐろ", aliases: ["マグロ", "鮪"] },
// { name: "鮭", aliases: ["さけ", "サケ", "サーモン", "しゃけ"] },
// { name: "サバ", aliases: ["鯖", "さば",] },
// { name: "アジ", aliases: ["あじ", "鯵",] },
// { name: "サンマ", aliases: ["さんま", "秋刀魚",] },
// { name: "たら", aliases: ["タラ", "鱈",] },
// { name: "ぶり", aliases: ["ブリ","鰤",] },
// { name: "カツオ", aliases: ["鰹","かつお",] },
// { name: "いわし", aliases: ["イワシ","鰯",] },
// { name: "さわら", aliases: ["鰆","サワラ",] },
// { name: "カレイ", aliases: ["かれい","鰈",] },
// { name: "たい", aliases: ["鯛","タイ",] },

// { name: "ツナ缶", aliases: ["つな","ツナ","つな缶", "つなかん","シーチキン","シーチキン缶" ] },
// { name: "サバの水煮缶", aliases: ["さば水煮","サバ水煮","鯖水煮","サバ水煮缶","さば水煮缶","鯖水煮缶","さばの水煮缶","鯖の水煮缶" ] },
// { name: "しらす", aliases: ["シラス","しらす干し","シラス干し", ] },
// { name: "かにかま", aliases: ["カニカマ","蟹かま","カニ風味かまぼこ","かに風味かまぼこ", ] },
// { name: "明太子", aliases: ["めんたいこ","辛子明太子","からしめんたいこ","明太","めんたい", ] },
// { name: "たらこ", aliases: ["タラコ","太子", ] },
// { name: "ちくわ", aliases: ["竹輪","チクワ", ] },
// { name: "さつま揚げ", aliases: ["さつまあげ","サツマアゲ","薩摩揚げ","薩摩揚", ] },
// { name: "えび", aliases: ["エビ", "海老",  ] },
// { name: "いか", aliases: ["イカ", "烏賊",  ] },
// { name:"たこ", aliases: ["タコ", "蛸",  ] },
// { name:"ホタテ", aliases: ["帆立", "ほたて", "ホタテ貝", "帆立貝",  ] },
// { name:"カニ", aliases: ["かに", "蟹",  ] },
// { name:"冷凍シーフードミックス", aliases: [ "シーフードミックス","冷凍シーフード","海鮮ミックス","海鮮ミックス冷凍",  ] },
// { name:"冷凍白身魚フライ", aliases: [ "白身魚フライ","白身フライ","魚フライ","フィッシュフライ",  ] },
// { name:"あさり", aliases: [ "アサリ", ] },



// { name: "木綿豆腐", aliases: ["とうふ", "豆腐", "もめん豆腐", "もめん", "木綿どうふ", "もめんとうふ"] },

// {
//       name: "絹ごし豆腐",
//       aliases: ["とうふ", "豆腐", "きぬごしとうふ", "きぬごし豆腐", "絹ごし", "きぬごし", "絹豆腐", "絹とうふ", "きぬ豆腐", "きぬとうふ"]
// },
// {
//       name: "焼き豆腐",
//       aliases: ["焼豆腐", "やきとうふ", "やき豆腐", "やきどうふ", "とうふ", "豆腐"]
// },
// {
//       name: "厚揚げ",
//       aliases: ["あつあげ", "厚あげ", "厚揚", "あつあげ豆腐", "厚揚げ豆腐", "とうふ", "豆腐"]
// },
// {
//       name: "油揚げ",
//       aliases: ["あぶらあげ", "あぶら揚げ", "油揚", "うすあげ", "揚げ", "あげ", "薄揚げ", "あぶらあげ豆腐", "揚げ豆腐", "とうふ", "豆腐"]
// },
// {
//       name: "納豆",
//       aliases: ["なっとう","ナットウ","ひきわり納豆","ひきわりなっとう","ひきわりナットウ"]
// },



// { name: "こんにゃく", aliases: ["コンニャク", "蒟蒻"] },
// { name: "春巻きの皮", aliases: ["皮", "かわ", "春巻き皮", "はるまき皮", "はるまきの皮", "春巻きかわ", "春巻きのかわ",] },
// { name: "餃子の皮", aliases: ["皮", "かわ", "ぎょうざの皮", "餃子皮", "ぎょうざ皮", "餃子のかわ", "ぎょうざのかわ",] },
// { name: "コーン", aliases: ["冷凍コーン", "とうもろこし", "トウモロコシ", "スイートコーン", "ホールコーン", "コーン粒", "コーンカーネル",] },
// { name: "コーン缶", aliases: ["コーン（缶詰)", "コーン缶詰", "こーん缶", "とうもろこし", "トウモロコシ", "スイートコーン", "ホールコーン", "コーン粒", "コーンカーネル",] },
// { name: "トマト缶", aliases: ["カットトマト", "ホールトマト", "ダイストマト", "トマト缶詰", "トマト（缶）", "トマトピューレ", "トマトソース缶", "トマトペースト",] },
// { name: "大豆・ひよこ豆", aliases: ["大豆", "だいず", "ダイズ", "水煮大豆", "ゆで大豆", "乾燥大豆", "煮豆", "蒸し大豆", "大豆（水煮）", "ひよこ豆", "大豆（ゆで）"] },
// { name: "メンマ", aliases: ["めんま", "シナチク", "しなちく", "支那竹", "ラーメンメンマ",] },
// { name: "紅ショウガ", aliases: ["紅ショウガ","紅しょうが","べにしょうが","しょうがの酢漬け","生姜の酢漬け","生姜漬け",] },



// { name: "玉ねぎ", aliases: ["たまねぎ", "タマネギ"] },
// { name: "にんじん", aliases: ["人参", "ニンジン"] },
// { name: "じゃがいも", aliases: ["ジャガイモ", "じゃが芋", "メークイン", "男爵", "ジャガ芋", "ばれいしょ", "馬鈴薯", "ポテト"] },
// { name: "さつまいも", aliases: ["サツマイモ", "さつま芋", "薩摩芋", "サツマ芋"] },
// { name: "大根", aliases: ["だいこん", "ダイコン"] },
// { name: "ごぼう", aliases: ["ゴボウ", "牛蒡"] },
// { name: "れんこん", aliases: ["蓮根", "レンコン"] },
// { name: "キャベツ", aliases: ["きゃべつ", "春キャベツ", "春きゃべつ"] },
// { name: "白菜", aliases: ["はくさい", "ハクサイ"] },
// { name: "ほうれん草", aliases: ["ほうれんそう", "ホウレンソウ", "ホウレン草", "法蓮草", "冷凍ほうれん草", "カットほうれん草"] },
// { name: "小松菜", aliases: ["こまつな", "コマツナ"] },
// { name: "レタス", aliases: ["れたす", "リーフレタス", "サニーレタス", "グリーンリーフ", "ロメインレタス", "玉レタス"] },
// { name: "水菜", aliases: ["みずな", "ミズナ"] },
// { name: "トマト", aliases: ["とまと"] },
// { name: "ミニトマト", aliases: ["みにとまと", "プチトマト", "ミディトマト"] },
// { name: "きゅうり", aliases: ["キュウリ", "胡瓜"] },
// { name: "ナス", aliases: ["なす", "茄子"] },
// { name: "ピーマン", aliases: ["ぴーまん", "ピーマン（緑）", "ピーマン（赤）", "ピーマン（黄）", "カラーピーマン"] },
// { name: "パプリカ", aliases: ["赤パプリカ", "黄パプリカ", "ぱぷりか", "赤パプリカ", "黄パプリカ", "オレンジパプリカ", "パプリカ（赤）", "パプリカ（黄）", "パプリカ（オレンジ）"] },
// { name: "ズッキーニ", aliases: ["ずっきーに", "ズッキーニ（緑）", "ズッキーニ（黄）"] },
// { name: "レモン", aliases: ["れもん", "スライスレモン", "檸檬", "レモン（輪切り）",] },
// { name: "レモン汁", aliases: ["れもん", "檸檬", "れもん汁", "レモン果汁"] },
// { name: "もやし", aliases: ["モヤシ"] },
// { name: "ブロッコリー", aliases: ["ぶろっこりー", "冷凍ブロッコリー", "茹でブロッコリー"] },
// { name: "アボカド", aliases: ["あぼかど", "冷凍アボカド"] },
// { name: "長いも", aliases: ["ながいも", "長芋", "とろろいも", "とろろ芋", "山芋"] },
// { name: "ゴーヤ", aliases: ["ごーや", "苦瓜", "にがうり", "ニガウリ"] },
// { name: "青ネギ", aliases: ["あおねぎ", "ネギ", "ねぎ", "青葱", "万能ねぎ", "万能ネギ", "小ねぎ", "小ネギ"] },
// { name: "白ネギ", aliases: ["白ねぎ", "しろねぎ", "長ネギ", "長ねぎ",] },
// { name: "ニラ", aliases: ["にら", "韮",] },
// { name: "しいたけ", aliases: ["椎茸", "シイタケ", "生しいたけ", "乾燥しいたけ", "干しシイタケ", "干し椎茸", "しいたけスライス",] },
// { name: "しめじ", aliases: ["シメジ", "ぶなしめじ", "ブナシメジ",] },
// { name: "えのき", aliases: ["エノキ", "えのき茸", "エノキ茸",] },
// { name: "エリンギ", aliases: ["えりんぎ", "エリンギ茸", "えりんぎ茸",] },
// { name: "マッシュルーム", aliases: ["まっしゅるーむ", "マッシュルーム（生）", "マッシュルーム（缶詰）", "マッシュルーム（スライス）", "マッシュルーム（冷凍）", "白マッシュルーム",] },
// { name: "まいたけ", aliases: ["舞茸", "マイタケ",] },
// { name: "三つ葉", aliases: ["みつば", "ミツバ",] },
// { name: "絹さや", aliases: ["きぬさや", "キヌサヤ", "絹サヤ",] },
// { name: "ブロッコリースプラウト", aliases: ["ぶろっこりースプラウト", "ぶろっこりーすぷらうと"] },
// { name: "たけのこ（水煮）", aliases: ["たけのこ", "タケノコ", "筍", "たけのこ水煮", "たけのこ（生）", "たけのこ（冷凍）"] },
// { name: "大葉", aliases: ["おおば", "オオバ", "青じそ", "青シソ", "しそ", "シソ"] },
// { name: "セロリ", aliases: ["せろり"] },


// { name: "米", aliases: ["こめ", "ごはん", "ご飯", "ゴハン", "コメ", "白米", "精白米", "うるち米",] },
// { name: "パン", aliases: ["食パン", "フランスパン", "バゲット", "ロールパン",] },
// { name: "スパゲティ", aliases: ["すぱげてぃ", "スパゲッティ", "パスタ",] },
// { name: "うどん", aliases: ["ウドン",] },
// { name: "そば", aliases: ["蕎麦", "ソバ",] },
// { name: "中華麺", aliases: ["ちゅうかめん", "チュウカメン", "中華そば", "ラーメン",] },
// { name: "マカロニ", aliases: ["まかろに",] },
// { name: "ピザ生地", aliases: ["ピザパン生地", "冷凍ピザ生地", "ピザクラスト", "ピザベース", "ピザ生地（市販）", "ピザ生地（冷凍）"] },
// { name: "そうめん", aliases: ["素麺","ソウメン"] },
// { name: "焼きそば", aliases: ["やきそば","ヤキソバ","焼きそば麺"] },



// { name: "塩", aliases: ["しお", "シオ"] },
// { name: "砂糖", aliases: ["さとう", "サトウ", "白砂糖", "グラニュー糖", "上白糖", "三温糖", "きび砂糖", "粉砂糖", "黒砂糖",] },
// { name: "はちみつ", aliases: ["ハチミツ", "蜂蜜",] },
// { name: "醤油", aliases: ["しょうゆ", "しょう油", "ショウユ", "濃口しょうゆ", "濃口醬油", "薄口しょうゆ", "薄口醬油",] },
// { name: "みそ", aliases: ["味噌", "ミソ", "赤味噌", "白味噌", "合わせ味噌", "麦味噌", "豆味噌",] },
// { name: "みりん", aliases: ["味醂", "ミリン", "本みりん", "みりん風調味料",] },
// { name: "めんつゆ", aliases: ["メンツユ", "麺つゆ", "めんつゆ（ストレート）", "めんつゆ（濃縮）",] },
// { name: "酒", aliases: ["サケ", "料理酒", "酒（料理用）", "酒（調理用）",] },
// { name: "白ワイン", aliases: ["しろわいん", "シロワイン", "ワイン（白）",] },
// { name: "赤ワイン", aliases: ["あかわいん", "アカワイン", "ワイン（赤）",] },
// { name: "酢", aliases: ["す", "ス", "米酢", "穀物酢",] },
// { name: "ポン酢", aliases: ["ぽんず", "ぽん酢", "ポンズ",] },
// { name: "油", aliases: ["あぶら", "アブラ", "サラダ油", "菜種油", "キャノーラ油",] },
// { name: "ショウガ", aliases: ["しょうが", "ショウガ（生）", "生姜"] },
// { name: "ニンニク", aliases: ["にんにく", "にんにく（生）", "にんにく（乾燥）", "ガーリック",] },
// { name: "ニンニクチューブ", aliases: ["にんにく（チューブ）", "にんにくチューブ",] },
// { name: "ショウガチューブ", aliases: ["しょうが（チューブ）", "しょうがチューブ", "生姜チューブ",] },
// { name: "塩コショウ", aliases: ["しおこしょう", "シオコショウ", "塩胡椒", "しお胡椒",] },
// { name: "こしょう", aliases: ["胡椒", "コショウ", "白こしょう", "ホワイトペッパー", "粉こしょう"] },
// { name: "黒コショウ", aliases: ["黒こしょう", "くろこしょう", "黒胡椒", "ブラックペッパー",] },
// { name: "わさび", aliases: ["ワサビ", "山葵",] },
// { name: "からし", aliases: ["カラシ", "辛子", "練りからし", "チューブからし",] },
// { name: "パン粉", aliases: ["ぱん粉", "ぱんこ", "パンコ", "パンこ",] },
// { name: "パン粉", aliases: ["ぱん粉", "ぱんこ", "パンコ", "パンこ",] },
// { name: "小麦粉", aliases: ["こむぎこ", "コムギコ"] },
// { name: "薄力粉", aliases: ["こむぎこ", "コムギコ", "はくりきこ", "ハクリキコ",] },
// { name: "強力粉", aliases: ["こむぎこ", "コムギコ", "きょうりきこ", "キョウリキコ"] },


 // { name: "たこ焼きの素", aliases: ["たこ焼きのもと", "タコ焼きの素", "たこ焼き粉", "タコ焼き粉", "たこ焼きミックス", "たこ焼き用粉", "たこ焼きミックス粉"] },
      // { name: "お好み焼きの素", aliases: ["お好み焼きのもと", "オコノミヤキの素", "お好み焼き粉", "お好み焼き用粉", "お好み焼きミックス", "お好み焼きミックス粉"] },
      // { name: "天かす", aliases: ["揚げ玉", "てんかす",] },
      // { name: "コンソメ", aliases: ["こんそめ", "コンソメキューブ", "コンソメ（固形）", "コンソメ（粉末）", "コンソメ顆粒", "ブイヨン", "チキンコンソメ", "野菜コンソメ",] },
      // { name: "鶏がらスープの素", aliases: ["鶏がらスープ", "チキンスープ", "鶏ガラスープ", "鶏ガラスープの素", "とりがらスープのもと",] },
      // { name: "中華だし", aliases: ["チュウカだし", "中華スープの素", "中華味だし", "中華調味料"] },
      // { name: "だし汁", aliases: ["だしじる", "だし", "だし（和風）", "和風だし", "かつおだし", "昆布だし",] },
      // { name: "顆粒だし", aliases: ["かりゅうだし", "カリュウだし", "かりゅうだし（和風）", "顆粒だし（和風）", "だしの素（顆粒）", "和風顆粒だし", "かつおだし（顆粒）", "昆布だし（顆粒）", "煮干しだし（顆粒）"] },
      // { name: "昆布", aliases: ["こんぶ", "コンブ", "乾燥昆布", "出汁昆布", "だし昆布"] },
      // { name: "かつお節", aliases: ["かつおぶし", "カツオブシ", "カツオ節", "鰹節", "削り節", "かつお削り節",] },
      // { name: "青のり", aliases: ["あおのり", "アオノリ", "青海苔", "あおのり粉", "青のり粉", "アオノリ粉",] },
      // { name: "イタリアンパセリ", aliases: ["パセリ", "ぱせり", "パセリ（イタリアン）",] },
      // { name: "パセリ", aliases: ["ぱせり",] },
      // { name: "片栗粉", aliases: ["かたくりこ", "かたくり粉", "カタクリコ", "カタクリ粉", "でんぷん粉", "じゃがいもでんぷん"] },
      // { name: "ごま油", aliases: ["ごまあぶら", "ゴマ油", "ゴマアブラ", "ごまオイル"] },
      // { name: "オリーブオイル", aliases: ["おりーぶおいる", "オリーブ油", "エクストラバージンオリーブオイル", "バージンオリーブオイル",] },
      // { name: "ケチャップ", aliases: ["けちゃっぷ", "トマトケチャップ", "とまとケチャップ", "トマトけちゃっぷ", "ケチャップソース", "トマトソース",] },
      // { name: "ピザソース", aliases: ["ぴざソース", "ピザ用ソース", "トマトピザソース",] },
      // { name: "中濃ソース", aliases: ["ちゅうのうソース", "チュウノウソース", "中濃ソース（とんかつ用）", "とんかつソース", "トンカツソース",] },
      // { name: "ウスターソース", aliases: ["うすたーそーす", "ウスター"] },
      // { name: "たこ焼きソース", aliases: ["たこやきソース", "たこやきそーす", "タコ焼きソース", "たこ焼き用ソース",] },
      // { name: "マヨネーズ", aliases: ["まよねーず", "まよ", "マヨ",] },
      // { name: "カレー粉", aliases: ["かれーこ", "カレーこ", "カレー粉（市販）", "カレー粉（粉末）",] },
      // { name: "山椒", aliases: ["さんしょう", "サンショウ",] },
      // { name: "パプリカパウダー", aliases: ["ぱぷりかぱうだー", "パプリカ粉末", "パプリカ粉", "パプリカスパイス"] },
      // { name: "粒マスタード", aliases: ["マスタード", "ますたーど", "つぶますたーど", "つぶマスタード"] },
      // { name: "マスタード", aliases: ["ますたーど", "マスタードソース", "洋からし", "洋辛子", "洋カラシ"] },
      // { name: "オイスターソース", aliases: ["オイスター", "おいすたーそーす"] },
      // { name: "ナンプラー", aliases: ["なんぷらー"] },
      // { name: "コチュジャン", aliases: ["こちゅじゃん"] },
      // { name: "ねりごま", aliases: ["練りごま", "ねりゴマ", "ごまペースト", "ごま（練り）"] },
      // { name: "白ごま", aliases: ["しろごま", "白ゴマ",] },
      // { name: "黒ごま", aliases: ["くろごま", "黒ゴマ",] },
      // { name: "のり", aliases: ["海苔", "ノリ",] },
      // { name: "梅干し", aliases: ["うめぼし", "梅干", "うめ干し", "梅ぼし"] },
      // { name: "唐辛子", aliases: ["とうがらし", "赤唐辛子", "乾燥唐辛子", "鷹の爪",] },
      // { name: "輪切り唐辛子", aliases: ["輪切りとうがらし", "輪切り赤唐辛子", "輪切り鷹の爪", "唐辛子（輪切り）", "とうがらし（輪切り）"] },
      // { name: "豆板醤", aliases: ["とうばんじゃん", "トウバンジャン"] },
      // { name: "テンメンジャン", aliases: ["てんめんじゃん", "甜麺醤"] },
      // { name: "ナツメグ", aliases: ["なつめぐ"] },
      // { name: "練乳", aliases: ["れんにゅう", "レンニュウ"] },
      // { name: "カレーのルウ", aliases: ["ルウ", "ルー", "カレールウ", "カレー粉末ルウ", "カレー用ルウ", "カレールー",] },
      // { name: "シチューのルウ", aliases: ["ルウ", "ルー", "シチュールウ", "シチュールー", "シチュー用ルウ", "クリームシチューのルウ", "クリームシチュールウ", "クリームシチュールー", "ビーフシチューのルウ", "ビーフシチュールウ", "ビーフシチュールー",] },
      // { name: "ハヤシライスのルウ", aliases: ["ルウ", "ルー", "ハヤシライスルウ", "ハヤシルー", "ハヤシ用ルウ", "デミグラスルウ", "ハヤシライス用ルウ",] },
      // { name: "バジル", aliases: ["ばじる",] },
      // { name: "ローズマリー", aliases: ["ろーずまりー",] },
      // { name: "ローリエ", aliases: ["ろーりえ",] },