export const week_menus=[

  {
      day: "月",
      date: 1,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "火",
      date: 2,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "水",
      date: 3,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "木",
      date: 4,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "金",
      date: 5,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "土",
      date: 6,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    },
    {
      day: "日",
      date: 7,
      title: "カレーライス",
      ingredients: ["米", "豚肉", "ジャガイモ", "人参", "玉ねぎ", "カレールー", "サラダ油"],
    }
]